<?php
defined('BASEPATH') OR exit('No direct script access allowed');

$config['api_code'] = [

//    梵响后台管理系统用到的api_code，可供参考
    0       => '正确',
    500     => '内部错误',

    //公共返回信息
    1001    => '无效token,请重新登录',
    1003    => '没有找到该用户',
    1006    => '登陆出错',

    //普通返回信息
    10002   => '没有输入code',
    10003   => '没有输入手机号',
    10007   => '用户频繁发送短信',
    10008   => '短信验证码不匹配',

//    0       => '正确',
//    // 200     => '无效token,请重新登录',
//    500     => '内部错误',
//
////  公共返回
//    1001    => '无效token,请重新登录',
//    1002    => '表单验证未通过',
//    1003    => '没有找到该用户',
//    1004    => 'bxid必须是6位的数字',
//    //1005    => '当前用户未找到，请重新登陆',
//    1006    => '登陆出错',
//
//
//
//
////  普通返回
//    //登陆相关
//    // 10010   => '没有传入token',
//    //10001   => '没有传type类型',
//    //10002   => '没有传code',
//    10003   => '没有传手机号',
//    //10004   => '该用户不存在',
//    10005   => 'type类型不合法',
//    10006   => '微信code错误',
//    10007   => '用户频繁发送短信',
//    10008   => '短信验证码不匹配',
//    10009   => '登陆手机验证码发送失败，请联系管理员',
//
//
//    //funxadmin相关
//    10011   => '页码参数有误',
//    10012   => '没有输入用户姓名',
//    10013   => '删除用户失败',
//
//    //company相关
//    10101    => '查询失败',
//    10102    => '添加新公司失败',
//    10103    => '公司信息修改失败',
//    10104    => '移除公司失败',
//    10105    => '绑定微信失败',
//    10106    => '没有上传文件',
//
//    //servicetype相关
//    10111   => '服务类型添加失败',
//    10112   => '服务类型修改失败',
//    10113   => '',
//


];
