<?php
defined('BASEPATH') OR exit('No direct script access allowed');

$config['api_code'] = [
    0       => '正确',
    500     => '内部错误',

    //公共返回信息
    1001    => '无效token,请重新登录',
    1002    => '表单验证未通过',
    1003    => '没有找到该用户',
    1004    => '文件上传失败',
    1005    => '没有输入查询所需要的必要信息',
    1006    => '登陆出错',
    1007    => '没有查询到记录',
    1008    => '查询到有重复的记录',
    1009    => '操作数据库出错',
    1010    => 'Redis错误',
    //普通返回信息

    //登陆相关
    10002   => '没有输入code',
    10003   => '没有输入手机号',
    10007   => '用户频繁发送短信',
    10008   => '短信验证码不匹配',

    //boss端
    //账单管理
    10020   => '请选择正确的年月',

    //员工端
    //办理入住
    10010   => '房间状态不是空闲',
    10011   => '不允许的操作，请检查住户状态',
    10012   => '没有操作权限，请切换到该门店管理员',
    10013   => '该房间不是占用状态',
    10021   => '房间状态不是预定!',
    //取消入住和取消预定
    10014   => '取消失败',
    10015   => '用户已经有支付过的订单',
    //确认支付
    10016   => '未找到订单信息或者订单状态错误!',
    10017   => '未检测到该住户的合同, 请生成后重试!',
    //现场支付
    10018   => '不支持的支付方式!',
    10019   => '未找到优惠券信息或者优惠券错误!',
    //续租
    10022   => '该房间已经有人租用, 请选择其他房间',
    10023   => '检测到未完成的账单, 请处理后重试!',
    10024   => '住户当前状态不能办理该业务!',
    //退房
    10025   => '正常退房与押金抵扣相冲突!',
    10026   => '该住户的退房订单已经存在!',
    10027   => '当前状态无法进行该操作!',
    10028   => '住户有未缴清的账单, 请核实或者选择押金抵扣!',
    10029   => '住户的住宿押金金额低于欠费金额, 无法抵扣!',

    //智能设备相关
    10050   => '蛋贝接口请求出错，数据返回失败',



];
